google_maps_interface/app/controllers/hotels_controller.rb

SELECT * FROM "cities"
---
  def index
    @cities = City.all

SELECT "cities".* FROM "cities" INNER JOIN "cityusers" ON "cities".id = "cityusers".city_id WHERE (("cityusers".user_id = 5))
SELECT * FROM "regions" WHERE (city_id = 626)
---
def get_regions
  request_city=current_user.cities
  @regionlist=[]
  @ri=0
  request_city.each { |i|
   if i
    @allregions=Region.all(:conditions => ["city_id = ?",i])

SELECT * FROM "states"
---
def get_states
  @allstate=State.all

SELECT * FROM "cities" WHERE ("cities"."id" = 626) LIMIT 1
SELECT "cities".* FROM "cities" INNER JOIN "cityusers" ON "cities".id = "cityusers".city_id WHERE ("cities"."id" = 626) AND (("cityusers".user_id = 5)) LIMIT 1
---
  def get_hotels
    var=params[:cityid].to_i
    @selectedCity=City.find_by_id(var)
    @Chotels=@selectedCity.hotels
    @HotelList = []
    if current_user.cities.find_by_id(var)

SELECT * FROM "cities" WHERE (latitude >= 36.27970727247193 AND latitude <= 49.12421930317003 AND longitude >= -96.3720699375 AND longitude <= -63.41308556250001)
SELECT "cities".* FROM "cities" INNER JOIN "cityusers" ON "cities".id = "cityusers".city_id WHERE ("cities"."id" = 7) AND (("cityusers".user_id = 5)) LIMIT 1
---
    def loadmarker
    minlt=params[:minlat].to_f
    maxlt=params[:maxlat].to_f
    minlg=params[:minlng].to_f
    maxlg=params[:maxlng].to_f
    @selectedCity=City.all(:conditions =>["latitude >= ? AND latitude <= ? AND longitude >= ? AND longitude <= ?",minlt,maxlt,minlg,maxlg])
    @HotelList = []
      if current_user
        @cur_user=current_user.cities
      #@Chotels=@selectedCity.Hotels

    for temphotel in @selectedCity
      if @cur_user.find_by_id(temphotel.id.to_i)