google_maps_interface/app/controllers/users_controller.rb

UPDATE "users" SET "perishable_token" = 'zZS2uzwE5DpnfL8MOdeh', "updated_at" = '2011-01-19 02:18:23' WHERE "id" = 5
---
  def update
    @user = current_user

    if @user.update_attributes(params[:user])